//В шкатулке хранится разноцветный бисер (или бусины). Все бусины имеют одинаковую форму, размер и вес. Бусины могут быть одного из N различных цветов. В шкатулке много бусин каждого цвета.
//Требуется определить минимальное число бусин, которые можно не глядя вытащить из шкатулки так, чтобы среди них гарантированно были две бусины одного цвета.
//Сколько раз надо взять по 2 бусины, чтобы они были одинакового цвета

using static System.Console;
Clear();

int amountcolor = Convert.ToInt32(ReadLine());
int amount = Convert.ToInt32(ReadLine());


WriteLine();


//Не могу сообразить((
